src/Catalogs/СтатьиДДС/СтатьиДДС.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтатьиДДС</name>
  <predefined>
    <items>
      <name>Аренда</name>
      <description>Аренда</description>
    </items>
    <items>
      <name>ЗаТовары</name>
      <description>За товары</description>
    </items>
    <items>
      <name>Зарплата</name>
      <description>Зарплата</description>
    </items>
    <items>
      <name>ЗарплатаНаКК</name>
      <description>Зарплата на к/к</description>
    </items>
    <items>
      <name>Инкассация</name>
      <description>Инкассация</description>
    </items>
    <items>
      <name>КомиссияБанка</name>
      <description>Комиссия банка</description>
    </items>
    <items>
      <name>Налог</name>
      <description>Налог</description>
    </items>
    <items>
      <name>Приход</name>
      <description>Приход</description>
    </items>
    <items>
      <name>ПриходПоКК</name>
      <description>Приход по к/к</description>
    </items>
    <items>
      <name>Расход</name>
      <description>Расход</description>
    </items>
  </predefined>
  <attributes>
    <name>КатегорияДвиженияДенежныхСредств</name>
    <type>
      <types>EnumRef.КатегорииДвиженияДенежныхСредств</types>
    </type>
  </attributes>
  <attributes>
    <name>НазначениеПлатежаПоУмолчанию</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияОперацииПоУмолчанию</name>
    <type>
      <types>CatalogRef.КатегорииОпераций</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидимостьКонтрагента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидимостьСчетаКонтрагента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидимостьДоговораКонтрагента</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидимостьСуммыКомиссии</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>РасчитыватьСуммуНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УстанавливатьНазначениеПлатежа</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>УстанавливатьКатегориюОперации</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентПоУмолчанию</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
</mdclass:Catalog>

src/Catalogs/СтатьиДДС/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ВидимостьСчетаКонтрагента.Видимость = Объект.ВидимостьКонтрагента;
	Элементы.ВидимостьДоговораКонтрагента.Видимость = Объект.ВидимостьКонтрагента;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидимостьКонтрагентаПриИзменении(Элемент)
	
	Элементы.ВидимостьСчетаКонтрагента.Видимость = Объект.ВидимостьКонтрагента;
	Элементы.ВидимостьДоговораКонтрагента.Видимость = Объект.ВидимостьКонтрагента;
	
КонецПроцедуры
